export const vehiclesData = [
  {
    label: '火车',
    value: '火车',
  },
  {
    label: '飞机',
    value: '飞机',
  },
  {
    label: '长途汽车',
    value: '长途汽车',
  },
  {
    label: '自驾',
    value: '自驾',
  },
];

export const destinationsData = [
  {
    label: '南昌西站',
    value: '南昌西站',
  },
  {
    label: '南昌站',
    value: '南昌站',
  },
  {
    label: '昌北机场',
    value: '昌北机场',
  },
  {
    label: '长途客运站',
    value: '长途客运站',
  },
  {
    label: '其他',
    value: '其他',
  },
];

export const campusData = [
  {
    label: '🏠 前湖北校区',
    value: '前湖北校区',
  },
  {
    label: '🚑 前湖南校区',
    value: '前湖南校区',
  },
  {
    label: '🍩 东湖校区',
    value: '东湖校区',
  },
  {
    label: '💻 青山湖校区',
    value: '青山湖校区',
  },
];

export const promiseData = `为切实维护学校正常教学秩序，保障本人及他人身体健康和生命安全，落实全员防控责任，根据国家疫情防控相关法律法规和学校疫情防控工作相关规定，本人郑重承诺\n

1.本人不是新冠肺炎确诊病例、疑似病例、无症状感染者、密切接触者、发热留观人员及其他传染性疾病患者。一起居住的亲友无以上人员，且目前均无发热、乏力、干咳等不适症状。\n

2.自觉加强入校途中个人自身防护工作，有特殊情况第一时间向辅导员报告。\n

3.入校后将严格遵守学校疫情防控相关规定，服从学校管理。积极配合落实各项疫情防控措施，按要求做好健康打卡，并如实报告。在寝室内不串门、不聚集。积极做好寝室的消毒、通风等工作，保证宿舍良好卫生。未经批准，不擅自离开校园。\n

4.若出现发热、乏力、干咳等不适症状，立即就地自我隔离并向辅导员报告，积极配合相关人员进行应急处置。\n

5.接到入校通知后，尽量不去外地，尤其是不去疫情中、高风险地区，做好入校准备。\n

本人明确知晓以上相关要求并已告知家长，即日起将严格遵守学校的疫情防控规定；保证所有上报信息真实准确。如违反国家、地方及学校的疫情防控要求，或瞒报谎报相关信息，本人愿意承担一切法律后果和纪律处分。\n

特此承诺。\n`;
