export const scoresExample = {
  "terms_gpa": {
    "2020-2021-1": "3.458",
    "2020-2021-2": "3.322"
  },
  "xh": "5504120045",
  "msg": "完成",
  "total": 3,
  "terms": [
    "2020-2021-0",
    "2020-2021-1",
    "2020-2021-2"
  ],
  "scores": [
    [
      {
        "exam_type": "通过制",
        "score": 75,
        "include": false,
        "lesson_name": "军事技能训练",
        "course_type": "公共基础课",
        "grade_point": 2.7,
        "lesson_type": "必修",
        "term": "2020-2021-0",
        "credit": 2.0
      }
    ],
    [
      {
        "exam_type": "正常考试",
        "score": 85,
        "include": true,
        "lesson_name": "军事理论",
        "course_type": "公共基础课",
        "grade_point": 3.7,
        "lesson_type": "必修",
        "term": "2020-2021-1",
        "credit": 2.0
      },
      {
        "exam_type": "正常考试",
        "score": 88,
        "include": true,
        "lesson_name": "物理演示实验",
        "grade_point": 3.7,
        "course_type": "专业选修课",
        "lesson_type": "选修",
        "term": "2020-2021-1",
        "credit": 1.0
      },
      {
        "exam_type": "正常考试",
        "score": 80,
        "include": true,
        "lesson_name": "体育（1）",
        "course_type": "公共基础课",
        "grade_point": 3.0,
        "lesson_type": "必修",
        "term": "2020-2021-1",
        "credit": 1.0
      },
      {
        "exam_type": "正常考试",
        "score": 91,
        "include": true,
        "lesson_name": "思想道德修养与法律基础",
        "course_type": "公共基础课",
        "grade_point": 4.0,
        "lesson_type": "必修",
        "term": "2020-2021-1",
        "credit": 3.0
      },
      {
        "exam_type": "正常考试",
        "score": 90,
        "include": true,
        "lesson_name": "普通物理（力学）",
        "course_type": "专业类平台课",
        "grade_point": 4.0,
        "lesson_type": "必修",
        "term": "2020-2021-1",
        "credit": 4.0
      },
      {
        "exam_type": "正常考试",
        "score": 76,
        "include": true,
        "lesson_name": "高等数学（1）上",
        "course_type": "公共基础课",
        "grade_point": 2.7,
        "lesson_type": "必修",
        "term": "2020-2021-1",
        "credit": 5.0
      },
      {
        "exam_type": "正常考试",
        "score": 90,
        "include": true,
        "lesson_name": "普通物理（热学）",
        "course_type": "专业类平台课",
        "grade_point": 4.0,
        "lesson_type": "必修",
        "term": "2020-2021-1",
        "credit": 2.0
      },
      {
        "exam_type": "正常考试",
        "score": 89,
        "include": true,
        "lesson_name": "形势与政策（1）",
        "course_type": "公共基础课",
        "grade_point": 3.7,
        "lesson_type": "必修",
        "term": "2020-2021-1",
        "credit": 0.5
      },
      {
        "exam_type": "正常考试",
        "score": 85,
        "include": true,
        "lesson_name": "学科导论课",
        "course_type": "专业类平台课",
        "grade_point": 3.7,
        "lesson_type": "必修",
        "term": "2020-2021-1",
        "credit": 1.0
      },
      {
        "exam_type": "正常考试",
        "score": 74,
        "include": true,
        "lesson_name": "大学英语（1）",
        "course_type": "公共基础课",
        "grade_point": 2.3,
        "lesson_type": "必修",
        "term": "2020-2021-1",
        "credit": 2.0
      },
      {
        "exam_type": "正常考试",
        "score": 85,
        "include": true,
        "lesson_name": "大学计算机",
        "course_type": "公共基础课",
        "grade_point": 3.7,
        "lesson_type": "必修",
        "term": "2020-2021-1",
        "credit": 2.5
      }
    ],
    [
      {
        "exam_type": "正常考试",
        "score": 81,
        "include": true,
        "lesson_name": "大学英语（2）",
        "grade_point": 3.0,
        "course_type": "专业选修课",
        "lesson_type": "选修",
        "term": "2020-2021-2",
        "credit": 2.0
      },
      {
        "exam_type": "正常考试",
        "score": 84,
        "include": true,
        "lesson_name": "形势与政策（2）",
        "course_type": "公共基础课",
        "grade_point": 3.3,
        "lesson_type": "必修",
        "term": "2020-2021-2",
        "credit": 0.5
      },
      {
        "exam_type": "正常考试",
        "score": 82,
        "include": true,
        "lesson_name": "普通物理（光学）",
        "course_type": "专业类平台课",
        "grade_point": 3.3,
        "lesson_type": "必修",
        "term": "2020-2021-2",
        "credit": 4.0
      },
      {
        "exam_type": "正常考试",
        "score": 85,
        "include": true,
        "lesson_name": "普通物理实验（1）",
        "course_type": "专业类平台课",
        "grade_point": 3.7,
        "lesson_type": "必修",
        "term": "2020-2021-2",
        "credit": 2.0
      },
      {
        "exam_type": "正常考试",
        "score": 74,
        "include": true,
        "lesson_name": "大学生心理健康指导",
        "course_type": "公共基础课",
        "grade_point": 2.3,
        "lesson_type": "必修",
        "term": "2020-2021-2",
        "credit": 2.0
      },
      {
        "exam_type": "正常考试",
        "score": 84,
        "include": true,
        "lesson_name": "高等数学（1）下",
        "course_type": "公共基础课",
        "grade_point": 3.3,
        "lesson_type": "必修",
        "term": "2020-2021-2",
        "credit": 5.0
      },
      {
        "exam_type": "正常考试",
        "score": 90,
        "include": true,
        "lesson_name": "英语口译技巧",
        "grade_point": 4.0,
        "course_type": "通识课（Ⅱ类）",
        "lesson_type": "公选",
        "term": "2020-2021-2",
        "credit": 2.0
      },
      {
        "exam_type": "正常考试",
        "score": 82,
        "include": true,
        "lesson_name": "大学生职业发展与就业指导",
        "course_type": "创新创业教育课",
        "grade_point": 3.3,
        "lesson_type": "必修",
        "term": "2020-2021-2",
        "credit": 1.0
      },
      {
        "exam_type": "正常考试",
        "score": 82,
        "include": true,
        "lesson_name": "观影之道：影视艺术赏析",
        "grade_point": 3.3,
        "course_type": "通识课（Ⅱ类）",
        "lesson_type": "公选",
        "term": "2020-2021-2",
        "credit": 2.0
      },
      {
        "exam_type": "正常考试",
        "score": 77,
        "include": true,
        "lesson_name": "普通物理（电磁学）",
        "course_type": "专业类平台课",
        "grade_point": 2.7,
        "lesson_type": "必修",
        "term": "2020-2021-2",
        "credit": 4.0
      },
      {
        "exam_type": "正常考试",
        "score": 91,
        "include": true,
        "lesson_name": "体育（2）",
        "course_type": "公共基础课",
        "grade_point": 4.0,
        "lesson_type": "必修",
        "term": "2020-2021-2",
        "credit": 1.0
      },
      {
        "exam_type": "正常考试",
        "score": 87,
        "include": true,
        "lesson_name": "高等代数",
        "course_type": "公共基础课",
        "grade_point": 3.7,
        "lesson_type": "必修",
        "term": "2020-2021-2",
        "credit": 4.0
      },
      {
        "exam_type": "正常考试",
        "score": 85,
        "include": true,
        "lesson_name": "中国近现代史纲要",
        "course_type": "公共基础课",
        "grade_point": 3.7,
        "lesson_type": "必修",
        "term": "2020-2021-2",
        "credit": 3.0
      }
    ]
  ],
  "xm": "覃天凤",
  "credits": 58.5,
  "terms_gpa_split": {
    "2020-2021-1": "3.458",
    "2020-2021-2": "3.322"
  },
  "status": 1
}


export const vehiclesData = [
  {
    label: '火车',
    value: '火车',
  },
  {
    label: '飞机',
    value: '飞机',
  },
  {
    label: '长途汽车',
    value: '长途汽车',
  },
  {
    label: '自驾',
    value: '自驾',
  },
];

export const destinationsData = [
  {
    label: '南昌西站',
    value: '南昌西站',
  },
  {
    label: '南昌站',
    value: '南昌站',
  },
  {
    label: '昌北机场',
    value: '昌北机场',
  },
  {
    label: '长途客运站',
    value: '长途客运站',
  },
  {
    label: '其他',
    value: '其他',
  },
];

export const campusData = [
  {
    label: '🏠 前湖北校区',
    value: '前湖北校区',
  },
  {
    label: '🚑 前湖南校区',
    value: '前湖南校区',
  },
  {
    label: '🍩 东湖校区',
    value: '东湖校区',
  },
  {
    label: '💻 青山湖校区',
    value: '青山湖校区',
  },
];

export const promiseData = `为切实维护学校正常教学秩序，保障本人及他人身体健康和生命安全，落实全员防控责任，根据国家疫情防控相关法律法规和学校疫情防控工作相关规定，本人郑重承诺\n

1.本人不是新冠肺炎确诊病例、疑似病例、无症状感染者、密切接触者、发热留观人员及其他传染性疾病患者。一起居住的亲友无以上人员，且目前均无发热、乏力、干咳等不适症状。\n

2.自觉加强入校途中个人自身防护工作，有特殊情况第一时间向辅导员报告。\n

3.入校后将严格遵守学校疫情防控相关规定，服从学校管理。积极配合落实各项疫情防控措施，按要求做好健康打卡，并如实报告。在寝室内不串门、不聚集。积极做好寝室的消毒、通风等工作，保证宿舍良好卫生。未经批准，不擅自离开校园。\n

4.若出现发热、乏力、干咳等不适症状，立即就地自我隔离并向辅导员报告，积极配合相关人员进行应急处置。\n

5.接到入校通知后，尽量不去外地，尤其是不去疫情中、高风险地区，做好入校准备。\n

本人明确知晓以上相关要求并已告知家长，即日起将严格遵守学校的疫情防控规定；保证所有上报信息真实准确。如违反国家、地方及学校的疫情防控要求，或瞒报谎报相关信息，本人愿意承担一切法律后果和纪律处分。\n

特此承诺。\n`;
